// Даны два числа. Показать большее и меньшее число

int a = 5;
int b = 8;

if (a > b)
{
    Console.WriteLine(a + " больше " + b);
}
else
{
    Console.WriteLine(b + " больше " + a);
}
